www/nano.org
#+SETUPFILE: css/level-0.orgcss
#+HTML: <script src="js/bootstrap.js"></script>
#+TITLE: GNU Nano 编辑器简介


* Why？

  nano 在 Debian 等系统中直接默认安装。它体积小、操作方便、上手快，在编辑文件时快捷灵活，在工作中给我带来了极大便利。希
  望没有用过 nano 的人们能够尝试这款文本编辑器。
  
* 简介

  [[http://www.nano-editor.org/][GNU Nano]] 是一款小巧友好的文本编辑器。nano 是 Pico 编辑器的自由克隆版本，也是 Pico 的功能增强版本。
  
  功能列表：
 * 基本文本编辑
 * 搜索
 * 拼写检查
 * 国际化支持
 * 自动缩进

  当然，作为一款编辑器，具有上面的特点也不足为奇。如果连基本的编辑功能都处理不了，nano 也就不能成其为编辑器。
  
* 常用快捷键

  nano 的许多操作快捷键与 Emacs 通用。其实，Emacs 里面的部分操作按键组合也适用在终端。

#+BEGIN_EXAMPLE
    ^G：^ 代表 Control 键
    M-G：M 一般为 Alt 键
#+END_EXAMPLE

#+CAPTION: GNU Nano 常用按键列表
|按键|作用|
|^X |退出 nano|
|^O |保存文件|
|^R |插入其他文件内容至光标位置 |
|^W |查找字符串 |
|^Y |跳至前一屏 |
|^V |跳至后一屏 |
|^K |剪切光标所在行并保存到剪贴板，或剪切选中内容 |
|^U |将剪贴板内容粘贴至当前行 |
|^C |显示光标位置 |
|M-/ (M-?) |跳至文件最后一行| 
|M-G |跳至指定行与列位置 |
|M-R |替换字符串 |
|M-A |标记游标所在文字 |
|M-W |重复上次搜索 |
|M-^ (M-6) |拷贝当前行至剪贴板 |
|M-} |缩进当前行 |
|M-{ |取消缩进当前行 |
|^F |向前跳一字符 |
|^B |向后跳一字符 |
|^Space |向前跳一个词 |
|M-Space |向后跳一个词 |
|^P |跳至前一行 |
|^N |跳至后一行 |
|^A |跳至当前行首| 
|^E |跳至当前行尾 |
|M-( (M-9) |跳至当前段落开头，如已在段落开头，则调至上一段落起始处 |
|M-) (M-0) |跳至当前段落结尾，如已在段落结尾，则调至下一段落结尾 |
|M-]| 移动至对应括号 |
|^M |插入新行于游标位置 |
|^D |删除游标之下的字符 |
|^H| 删除游标左侧的字符 |
|M-T| 从游标位置剪切至文件结尾 |
|M-D |计算字数、行数与字符数|

* nano 辅助功能说明

  *提示*： 

 * ^Space 按键可能与中文输入法调出按键冲突，如冲突，则该按键组合在 nano 编辑器内失效。 
 * 如果使用 nano 打开文本文件时，出现“/home/用户名/.nano_history 出错：权限问题”报告，可使用下面步骤解决：

  A:打开 /etc/nanorc 文件，将 set historylog 一行注释：

#+BEGIN_SRC shell
  $ sudo nano /etc/nanorc # 注释 set historylog，保存退出 
#+END_SRC
  
  B:删除 =~/.nano_history=

#+BEGIN_SRC shell
sudo rm ~/.nano_history    
#+END_SRC
