emacs-blog/public_html/nano.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>GNU Nano 编辑器简介</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="GNU Nano 编辑器简介"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-21T22:08+0800"/>
<meta name="author" content="tuhaihe"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link href="css/org.css" rel="stylesheet" type="text/css">
<link href="css/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="css/bootstrap-responsive.min.css" rel="stylesheet">


</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">GNU Nano 编辑器简介</h1>


<script src="js/bootstrap.js"></script>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Why？</a></li>
<li><a href="#sec-2">简介</a></li>
<li><a href="#sec-3">常用快捷键</a></li>
<li><a href="#sec-4">nano 辅助功能说明</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Why？</h2>
<div class="outline-text-2" id="text-1">


<p>
  nano 在 Debian 等系统中直接默认安装。它体积小、操作方便、上手快，在编辑文件时快捷灵活，在工作中给我带来了极大便利。希
  望没有用过 nano 的人们能够尝试这款文本编辑器。
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">简介</h2>
<div class="outline-text-2" id="text-2">


<p>
  <a href="http://www.nano-editor.org/">GNU Nano</a> 是一款小巧友好的文本编辑器。nano 是 Pico 编辑器的自由克隆版本，也是 Pico 的功能增强版本。
</p>
<p>  
  功能列表：
</p><ul>
<li>基本文本编辑
</li>
<li>搜索
</li>
<li>拼写检查
</li>
<li>国际化支持
</li>
<li>自动缩进

<p>
  当然，作为一款编辑器，具有上面的特点也不足为奇。如果连基本的编辑功能都处理不了，nano 也就不能成其为编辑器。
</p></li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">常用快捷键</h2>
<div class="outline-text-2" id="text-3">


<p>
  nano 的许多操作快捷键与 Emacs 通用。其实，Emacs 里面的部分操作按键组合也适用在终端。
</p>



<pre class="example">^G：^ 代表 Control 键
M-G：M 一般为 Alt 键
</pre>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>GNU Nano 常用按键列表</caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">按键</td><td class="left">作用</td></tr>
<tr><td class="left"><sup>X</sup></td><td class="left">退出 nano</td></tr>
<tr><td class="left"><sup>O</sup></td><td class="left">保存文件</td></tr>
<tr><td class="left"><sup>R</sup></td><td class="left">插入其他文件内容至光标位置</td></tr>
<tr><td class="left"><sup>W</sup></td><td class="left">查找字符串</td></tr>
<tr><td class="left"><sup>Y</sup></td><td class="left">跳至前一屏</td></tr>
<tr><td class="left"><sup>V</sup></td><td class="left">跳至后一屏</td></tr>
<tr><td class="left"><sup>K</sup></td><td class="left">剪切光标所在行并保存到剪贴板，或剪切选中内容</td></tr>
<tr><td class="left"><sup>U</sup></td><td class="left">将剪贴板内容粘贴至当前行</td></tr>
<tr><td class="left"><sup>C</sup></td><td class="left">显示光标位置</td></tr>
<tr><td class="left">M-/ (M-?)</td><td class="left">跳至文件最后一行</td></tr>
<tr><td class="left">M-G</td><td class="left">跳至指定行与列位置</td></tr>
<tr><td class="left">M-R</td><td class="left">替换字符串</td></tr>
<tr><td class="left">M-A</td><td class="left">标记游标所在文字</td></tr>
<tr><td class="left">M-W</td><td class="left">重复上次搜索</td></tr>
<tr><td class="left">M-^ (M-6)</td><td class="left">拷贝当前行至剪贴板</td></tr>
<tr><td class="left">M-}</td><td class="left">缩进当前行</td></tr>
<tr><td class="left">M-{</td><td class="left">取消缩进当前行</td></tr>
<tr><td class="left"><sup>F</sup></td><td class="left">向前跳一字符</td></tr>
<tr><td class="left"><sup>B</sup></td><td class="left">向后跳一字符</td></tr>
<tr><td class="left"><sup>Space</sup></td><td class="left">向前跳一个词</td></tr>
<tr><td class="left">M-Space</td><td class="left">向后跳一个词</td></tr>
<tr><td class="left"><sup>P</sup></td><td class="left">跳至前一行</td></tr>
<tr><td class="left"><sup>N</sup></td><td class="left">跳至后一行</td></tr>
<tr><td class="left"><sup>A</sup></td><td class="left">跳至当前行首</td></tr>
<tr><td class="left"><sup>E</sup></td><td class="left">跳至当前行尾</td></tr>
<tr><td class="left">M-( (M-9)</td><td class="left">跳至当前段落开头，如已在段落开头，则调至上一段落起始处</td></tr>
<tr><td class="left">M-) (M-0)</td><td class="left">跳至当前段落结尾，如已在段落结尾，则调至下一段落结尾</td></tr>
<tr><td class="left">M-]</td><td class="left">移动至对应括号</td></tr>
<tr><td class="left"><sup>M</sup></td><td class="left">插入新行于游标位置</td></tr>
<tr><td class="left"><sup>D</sup></td><td class="left">删除游标之下的字符</td></tr>
<tr><td class="left"><sup>H</td><td class="left"></sup> 删除游标左侧的字符</td></tr>
<tr><td class="left">M-T</td><td class="left">从游标位置剪切至文件结尾</td></tr>
<tr><td class="left">M-D</td><td class="left">计算字数、行数与字符数</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">nano 辅助功能说明</h2>
<div class="outline-text-2" id="text-4">


<p>
  *提示*： 
</p>
<ul>
<li><sup>Space</sup> 按键可能与中文输入法调出按键冲突，如冲突，则该按键组合在 nano 编辑器内失效。 
</li>
<li>如果使用 nano 打开文本文件时，出现“/home/用户名/.nano<sub>history</sub> 出错：权限问题”报告，可使用下面步骤解决：

<p>
  A:打开 /etc/nanorc 文件，将 set historylog 一行注释：
</p></li>
</ul>





<pre class="example">$ sudo nano /etc/nanorc # 注释 set historylog，保存退出 
</pre>


<p>  
  B:删除 <code>~/.nano_history</code>
</p>



<pre class="example">sudo rm ~/.nano_history    
</pre>

</div>
</div>
</div>

<div id="postamble">
<p class="postamble">Update time: 2013-04-21T22:08+0800.</p> 
</div>
</body>
</html>
